function a(){
  var link = document.createElement('a');
  link.textContent = 'بیشتر بدانید';
  link.style.display = 'none'; // مخفی کردن لینک در حالت پیش فرض
}
  
var mercuryLink = 'https://example.com/mercury';
var venusLink = 'https://example.com/venus';
var marsLink = ''
var earthLink = ''
var jupeterLink = ''
var saturnLink = ''
var uranusLink = ''
var neptuneLink = ''
var plutoLink = ''

var planets = ['Mercury','Venus','Earth','Mars','Jupeter','Saturn','Uranus','Neptune','Pluto'];
var translations = ['translate(1650px, -550px) scale(8.5)','translate(1720px, -350px) scale(8)',
'translate(1500px, 0px) scale(5)','translate(1150px, -420px) scale(3.75)','translate(685px, -370px) scale(2)',
'translate(250px, -80px) scale(1.3)','translate(65px, -40px) scale(4)','translate(-80px, -500px) scale(6)',
'translate(-130px, -180px) scale(6)'];

planets.forEach(function(planet, index){
  var element = document.querySelector('.'+planet);
  element.style.transition = 'transform 3s';
  element.addEventListener('click',(function(){
  var isClicked = false;
  return function(){
  if (!isClicked){
    this.querySelector('a').href = mercuryLink; // برای سیاره عطارد
    this.style.transform = translations[index];
    this.style.zIndex = '999';
    isClicked = true;
  } else {
    this.style.transform = '';
    this.style.zIndex = '';
    isClicked = false;
  }};})());});//سیاره ها

var overlay = document.querySelector('.overlay');
var taga = document.querySelector('.a');
planets.forEach(function(planet, index){
var element = document.querySelector('.' + planet);
element.style.transition ='transform 0s';
element.addEventListener('click', (function(){
var isClicked = false;
return function(){
if (!isClicked){
  this.style.transform = translations[index];
  this.style.zIndex = '800';
  overlay.classList.add('active');
  isClicked = true;
} else{
  this.style.transform = '';
  this.style.zIndex = '';
  overlay.classList.remove('active');
  isClicked = false;
}};})());});
var text = document.querySelector('.text');
var texts = ['<b>Mercury : عطارد</b></br><b>عطارد کوچک‌ترین سیاره منظومه شمسی است و نزدیک‌ترین سیاره به خورشید قرار دارد. سرعت عطارد بسیار بالاست، به طوری که هر ۸۸ روز، یک بار دور خوردشید میچرخد. از این رو، عطارد گریزپا است و به همین دلیل ایرانیان باستان آن را (تیر) نامیده‌اند</b><br><b>سطح عطارد پر از سنگ‌ و خشکی است. عطارد دارای دمای بسیار بالا در روز و بسیار پایین در شب است. عطارد قمر ندارد و سطح رو به خورشید آن بسیار داغ و رویه‌ی پشت به خورشید آن بسیار سرد است</b><br><b>عطارد گسترده‌ترین تغییرات دمایی را نسبت به سایر سیاره‌های منظومه‌ی شمسی تجربه می‌کند. دمای سطح در روز به حدود 427  درجه‌ی سلسیوس می‌رسد، در حالی که در شب، دما به 180 درجه‌ی سلسیوس زیر صفر کاهش می‌یابد. دمای میانگین سیاره‌ی عطارد حدود 167 درجه‌ی سلسیوس است. </b><br><b>عطارد دارای جَو رقیق است.  ترکیب جو عطارد شامل ملکول‌های اکسیژن(O₂ )، سدیم(Na)، هیدروژن(H₂)، هلیوم(He) و مقدار ناچیزی آرگون(Ar)، نیتروژن(N₂)، کربن دی‌اکسید(CO₂)، بخار آب(O₂)، گزنون(Xe)، کریپتون(Kr) و نئون(Ne) است</b><br><b>چرخش عطارد با گرفتاری در قفل جزر و مدی و رزنانس مداری ۳:۲ با خورشید، در سامانه خورشیدی، یک چرخش سیاره‌ای بی‌همتاست. این سیاره به ازای هر دو بار گردش به دور خورشید، دقیقاً سه‌بار به دور خود می‌چرخد . پس در این سیاره هر دو سال ،سه روز آن سیاره می‌باشد. </b><br><b>گرانش عطارد با واحد نیوتن نشان داده می‌شود. این نیروی گرانشی که عطارد به آن دچار است، حدود 3.7  نیوتن بر کیلوگرم است. این مقدار نیروی گرانشی کمتر از نیروی گرانشی در سطح زمین است. </b>',
'<i style="font-size:55px;">Venus : زهره(ونوس یا ناهید)</i><br><i  style="font-size:55px;">سیاره ونوس، که در فارسی به آن بیدُخت و بیلفت نیز گفته می‌شود، دومین سیاره و نزدیکترین همسایه سیاره‌ای ما است. ونوس از نظر ساختار و اندازه، مشابه زمین است و در جهت مخالف بیشتر سیارات، به آرامی می‌چرخد.</i><br><i  style="font-size:55px;">ونوس سیاره‌ای است که فاقد اقیانوس است و توسط جو بسیار سنگینی احاطه شده است که بیشتر از دی اکسید کربن و تقریباً از بخار آب تشکیل نشده است. در سطح ونوس فشار جو 92 برابر بیشتر از سیاره ی ماست. این بدان معنی است که یک فرد عادی نمی تواند یک دقیقه روی سطح این سیاره دوام بیاورد. ابرها از سولفوریک اسید تشکیل شده‌اند. </i><br><i  style="font-size:55px;">زهره یکی از دو سیاره‌ای است که از شرق به غرب می‌چرخد و فقط این خاصیت در زهره و اورانوس قابل مشاهده است. </i><br><i  style="font-size:55px;">یک روز ونوس معادل 243 روز زمینی است و طولانی‌ترین شبانه‌روز را به نام خود ثبت کرده است. نکته ی جالب این است که یک روز این سیاره از یک سال آن طولانی‌تر است.</i><br><i  style="font-size:55px;">تقریباً تمام دانش موجود در مورد ونوس از طریق فضاپیماهایی بدست آمده است که قادر به پایین آمدن از آن جو متراکم حامل کاوشگرها هستند. از سال 2013، 46 بار ماموریت به این سیاره سوزان انجام شده است .</i><br><i  style="font-size:55px;"></i>',

'<u style="text-decoration: none;">Earth : زمین</u><br><u style="text-decoration: none;">زمین سومین سیارهٔ سامانه خورشیدی است که در فاصلهٔ ۱۴۹٬۶۰۰٬۰۰۰ کیلومتر از ستارهٔ خورشید قرار گرفته. این سیاره چگال‌ترین (به دلیل دارا بودن منابع وسیع آهن و فلزات دیگر) و از نظر بزرگی پنجمین سیاره از سیارات منظومهٔ شمسی است. همچنین در میان چهار سیارهٔ سنگی گردان به دور خورشید (عطارد، زهره، زمین و مریخ) ، زمین بزرگ‌ترین آن‌ها است.</u><br><u style="text-decoration: none;">زمین با سالی که 365 روز طول می کشد و دوره چرخش آن 24 ساعت است، همچنین تنها سیاره منظومه شمسی است که دارای تکتونیک صفحه فعال و میدان مغناطیسی است. محور چرخش زمین نسبت به صفحه مدار سیاره زمین به دور خورشید 23/4 درجه انحراف دارد. این شیب باعث چرخه سالانه فصول در زمین می‌شود.</u><br><u style="text-decoration: none;">جرم زمین تقریباً( ۵٫۹۸×۱۰^۲۴ )کیلوگرم است و بیشتر از عنصرهایی مانند آهن (۳۲٫۱٪)، اکسیژن (۳۰٫۱٪)، سیلیسیم (۱۵٫۱٪)، منیزیم (۱۳٫۹٪)، گوگرد (۲٫۹٪)، نیکل (۱٫۸٪)، کلسیم (۱٫۵٪) و آلومینیم تشکیل شده است.</u><br><u style="text-decoration: none;">سطح زمین یک سطح جامد و فعال با کوه‌ها، دره‌ها، دشت‌ها صحراها و موارد دیگر است. سطح این سیاره از ۷۱ درصد آب پوشیده شده است. کره زمین که کمی بزرگتر از سیاره ناهید است بین چهار سیاره نزدیک به خورشید که همگی از سنگ و فلز ساخته شده‌اند، بزرگترین است.</u><br><u style="text-decoration: none;">اتمسفر زمین ترکیبی از ۷۸٪ نیتروژن، ۲۱٪ اکسیژن، ۰/۹۳٪ آرگون، ۰/۰۳۸٪ دی‌اکسید کربن و نزدیک به ۱٪ بخار آب (با توجه به اقلیم مقدار آن تغییر می‌کند) است.</u>',

'<s style="font-size:47px;text-decoration:none;">Mars : مریخ(بهرام)</s><br><s style="font-size:47px;text-decoration:none;">مریخ چهارمین سیاره در منظومهٔ شمسی است که در یک مدار طولانی‌تر و با سرعتی کمتر از زمین به دور خورشید می‌چرخد. نام فارسی این سیاره بهرام و نام عربی-یونانی آن مِریخ است. قطر مریخ نزدیک به یک‌دوم قطر زمین و برابر ۶٬۷۹۰ کیلومتر است. جرم آن 6.4169 x 10^23 کیلوگرم و تراکم آن 3.934 گرم در سانتی متر مکعب است.</s><br><s style="font-size:47px;text-decoration:none;">مریخ در فاصلهٔ ۱٫۵۲۳۶۷۹ AU یا ۲۲۷٬۹۳۹٬۱۰۰ km از خورشید قرار دارد. هر یک بار گردش این سیاره به دور خورشید معادل ۶۸۷ شبانه ‌روز زمینی طول می‌کشد. روزهای مریخ ۲۴ ساعت و ۳۷ دقیقه زمینی طول می‌کشد.</s><br><s style="font-size:47px;text-decoration:none;">مریخ سیاره‌ای سنگی مانند بقیه سیارات تلوریک است. رنگ مسی روشن مریخ به دلیل فراوانی مواد معدنی غنی از آهن در رگولیت‌های آن است.</s><br><s style="font-size:47px;text-decoration:none;">سطح مریخ دارای یخهای قطبی، دره‌های عمیق، کوه، غبار، طوفان و فصل دارد. بزرگ‌ترین کوه آتشفشان و دومین کوه بلند در کل منظومه شمسی در مریخ قرار گرفته است. البته جالب است بدانید چندین هزار سال پیش، مریخ نمونه ی حال حاضر زمین بوده است و طول تاریخ با تغییرات ناشناخته به این صورت در آمده است که اغلب دانشمندان یقین دارند قبل از حیات انسان، در مریخ حیات وجود دارد.</s><br><s style="font-size:47px;text-decoration:none;">اتمسفر مریخ ترکیبی از ۹۵٫۹۷٪ کربن دی‌اکسید، ۱٫۹۳٪ آرگون، ۱٫۸۹٪ نیتروژن، ۰٫۱۴۶٪ اکسیژن و مقدار کمی بخار آب است.</s>',

'<big>Saturn : زحل(کیوان)</big><br><big>زحل بعد از سیارهٔ مشتری، دومین سیارهٔ بزرگ سامانه خورشیدی و ششمین سیارهٔ نزدیک به خورشید است. این سیاره یک گلولهٔ گازی غول‌پیکر است که با وجود حجم زیادش تنها ۹۵٫۱۵۹ برابر زمین جرم دارد. چگالی این سیاره حدود یک‌هشتم زمین و خیلی کمتر از آب است. یک روز کامل در زحل برابر ۱۰ ساعت و ۳۹ دقیقه در زمین و یک سال آن ۲۹٫۵ برابر سال زمین است.</big><br><br><big>زحل در فاصلهٔ ۹٫۵۳۹ واحد نجومی از خورشید و تناوب مداری ۲۹٫۵ سال، در مداری که با مدار زمین زاویه ۲٫۴۸ درجه می‌سازد، می‌گردد. از روی زمین قطر زاویه‌ای زحل در نقطهٔ مقابله حدود ۲۰ ثانیهٔ قوسی(بر اساس نیروی جاذبه بر نور و زمان که مرتبط با نظریه زمان نسبی نیوتن است) است.</big><br><big>سطح زحل دارای حلقه‌های بسیار زیبا و دیدنی است. این حلقه‌ها از تکه‌های سنگ و یخ تشکیل شده‌اند.</big><br><big>زحل نیز مانند مشتری، یکی از غول‌های گازی سیستم خورشیدی است که گاز آن عمدتا ترکیبی از هیدروژن، هلیوم و متان می‌باشد.</big><br><big>اتمسفر زحل یکی از جذابیت‌های این سیاره است. اطلاعات دقیقی در مورد ترکیبات گازی این اتمسفر وجود ندارد.</big>',

'<small style="font-size:53px; width:90%;">Jupeter : مشتری(هرمز)</small><br><small style="font-size:53px;"width:90%;>مشتری یا هُرمُز (که به نام‌های بِرجیس ، اورمزد ، زاوش و یا ژوپیتر)، بزرگ‌ترین سیاره در منظومهٔ شمسی است. این سیارهٔ غول گازی با جرم یک‌هزارم خورشید است، ولی جرمی دو و نیم برابر تمامی دیگر سیاره‌های منظومهٔ شمسی دارد. از نظر دوری از خورشید، مشتری پنجمین سیاره پس از تیر ، ناهید ، زمین و بهرام است.</small><br><small style="font-size:53px;"width:90%;>مشتری در فاصلهٔ ۱٫۵۲۳۶۷۹ AU یا ۲۲۷٬۹۳۹٬۱۰۰ km از خورشید قرار دارد. هر یک بار گردش این سیاره به دور خورشید معادل ۶۸۷ شبانه‌روز زمین طول می‌کشد. روزهای مشتری ۲۴ ساعت و ۳۷ دقیقه طول می‌کشد.</small><br><small style="font-size:53px;"width:90%;>مشتری سیاره‌ای گازی است که از هیدروژن و هلیوم تشکیل شده است و هیچ سطح جامدی ندارد. سطح مشتری دارای یخهای قطبی، دره‌های عمیق، کوه، غبار، طوفان و فصل دارد. بزرگ‌ترین کوه آتشفشان و دومین کوه بلند در کل منظومه شمسی در مشتری قرار گرفته است.</small><br><small style="font-size:53px;"width:90%;>اتمسفر مشتری ترکیبی از ۸۹٫۸±۲٫۰٪ هیدروژن (H 2)، ۱۰٫۲±۲٫۰٪ هلیوم، ~۰٫۳٪ متان، ~۰٫۰۲۶٪ آمونیاک، ~۰٫۰۰۳٪ هیدروژن دوترید (HD)، ۰٫۰۰۰۶٪ اتان، ۰٫۰۰۰۴٪ آب.</small>',

'<em style="font-size:55px;width:100%">Uranus : اورانوس</em><br><em style="font-size:55px;width:100%">اورانوس یکی از سیارات هشت‌گانهٔ منظومهٔ خورشیدی است که از لحاظ بُعد فاصله‌اش نسبت به خورشید در ردیف هفتم پس از کیوان (زحل) قرار گرفته‌است. این سیاره با شعاع 25362 کیلومتر (15759٫2 مایل) 4 برابر از زمین پهن‌تر است. از فاصله متوسط 2٫9 میلیارد کیلومتر (1٫8 میلیارد مایل) اورانوس 19٫8 واحد نجومی با خورشید فاصله دارد.</em><br><em style="font-size:55px;width:100%">اورانوس چون سیاره گازی است، پوسته یا سطح خارجی ندارد و فقط حاوی گوشته و هسته است. آنچه در تصاویر تلسکوپ‌ها می‌بینیم در اصل جو اورانوس است که آن‌را احاطه کرده است. اورانوس سردترین سیاره منظومه شمسی است و رکورد دمای ۲۲۴- درجه سانتی‌گراد به نام اورانوس ثبت شده است.</em><br><em style="font-size:55px;width:100%">اورانوس دارای بیش از ۲۷ قمر است که میراندا، آریل، آمبریل، تیتانیا و اوبرون از شناخته‌شده‌ترین آن‌ها هستند. این سیاره را ویلیام هرشل در سال ۱۷۸۱ میلادی کشف کرد. اورانوس تنها سیاره‌ای است که خط استوای آن تقریباً با زاویه راست در مدار خود قرار دارد و دارای شیب 97٫77 درجه است که این موضوع احتمالاً نتیجه برخورد این سیاره با جسمی به اندازه زمین بوده است.</em>',

'<strong style="font-size:53px; width:90%;">Neptune : نپتون</strong><br><strong style="font-size:53px; width:90%;">نپتون یکی از سیارات منظومه شمسی است که در ردیف هشتم و در فاصله بیشتری نسبت به خورشید قرار دارد. نپتون با قطری برابر با 49,528 کیلومتر، چهار برابر بزرگ‌تر از زمین است. جرم این سیاره 17 برابر جرم زمین است.</strong><br><strong style="font-size:53px; width:90%;">یک سال در نپتون معادل با 165 سال زمینی است. این به این معنی است که نپتون برای یک دور کامل حرکت در مدار خود نیاز به 165 سال زمینی دارد. همچنین، یک روز در نپتون معادل با 16 ساعت و 7 دقیقه زمینی است.</strong><br><strong style="font-size:53px; width:90%;">نپتون دارای 13 قمر است که بزرگ‌ترین آن‌ها تریتون نام دارد. این سیاره از مشتری، زحل و اورانوس کوچک‌تر است و به همین دلیل چهارمین سیاره بزرگ منظومه شمسی است.</strong><br><strong style="font-size:53px; width:90%;">رنگ آبی پررنگ نپتون باعث زیبایی منحصر به فرد این سیاره شده است. این رنگ آبی پررنگ دلیل اصلی نامگذاری این سیاره بر اساس نام خدای رومی دریاها، یعنی نپتون، بوده است.</strong><br><strong style="font-size:53px; width:90%;">نپتون در سال 1846 کشف شد. از آن زمان تا کنون، تمام اطلاعات ما درباره این سیاره در طول 171 سال گذشته به دست آمده است. این به این معنی است که از زمان کشف نپتون، این سیاره تنها یک بار به دور خورشید گردش کرده است.</strong>',

'<i>پلوتون یک سیاره کوتوله در کمربند کویپر است. این سیاره کوچک با جرمی معادل یک سوم ماه، از سنگ و یخ ساخته شده است. قطر پلوتون 2,370 کیلومتر است و این سیاره گاهی از زمین تا فاصله 7.5 میلیارد کیلومتری دور می‌شود.</i><br><i>طول هر شبانه روز پلوتون (زمانی که سیاره یک بار حول محور خود می‌چرخد) معادل 153 ساعت زمینی است. مدار پلوتون به دور خورشید، میل تندی دارد و فاصله متوسط آن از خورشید 5.915 میلیارد کیلومتر است. در این فاصله، خورشید فقط به صورت یک ستاره درخشان دیده می‌شود.</i><br><i>پلوتون دارای چهار لکه سیاه روی سطح خود است که به کمربند تیرهٔ دور استوای پلوتو متصل هستند و تقریباً به یک اندازه و به یک فاصله هستند. این ویژگی باعث شده است که توجه دانشمندان به خود جلب کند.</i><br><i>دمای سطحی نهمین سیاره، در فاصله 5.91 میلیارد کیلومتری خورشید، احتمالا حدود منهای 230 درجه سانتیگراد است. می‌دانیم روی پلوتون مناطق تیره‌ای وجود دارد، اما نمی‌توانیم با اطمینان بگوییم که در این مناطق نیتروژن با متان یخ زده وجود ندارد.</i><br><i>پلوتون در سال 1930 توسط کلاید تامبا کشف شد. تا پیش از گذر کاوشگر فضایی نیو هورایزنز (افق‌های نو) از کنار آن در 14 ژوئیه 2015، هیچ‌ یک از مأموریت‌های فضایی از سوی زمین به آن نرسیده بود و به علت فاصله ی زیاد و فقدان ذخیره ی نیرو نتوانستند به این سیاره ی کوتوله برسند.</i><br><i>پلوتون دارای 5 قمر است. بزرگ‌ترین قمر پلوتون، شارون نام دارد. شارون و پلوتو به گونه‌ای ویژه‌ای که در منظومهٔ شمسی نادر است وابسته به یکدیگر شده و رو در روی هم، گردش هماهنگ یا قفل جزر و مدی را تجربه می‌کنند و باز این هم به علت کوچک بودن این سیاره است.</i>'
];

planets.forEach(function(planet, index){
var element = document.querySelector('.' + planet);
element.style.transition = 'transform 3.5s';
taga.zIndex = '999999';
element.addEventListener('click', (function(){
var isClicked = false;
return function(){
if (!isClicked){
  taga.style.visibility = 'visible';
  this.style.transform = translations[index];
  this.style.zIndex = '999999';
  text.innerHTML = texts[index];
  setTimeout(function(){
    text.style.visibility = 'visible';
  }, 1500)
  text.style.zIndex = '1000000';
  isClicked = true;
}else{
  taga.style.visibility = 'hidden';
  this.style.transform = '';
  this.style.zIndex = '';
  text.style.visibility = 'hidden';
  text.style.zIndex = '';
  isClicked = false;
}};})());});
